<a href="https://colab.research.google.com/github/Macharia-254/WEEK-3-IP/blob/main/Moringa_Data_Science_Prep_W3_Independent_Project_2019_07_Newton_Muthii_Python_notebook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
#importing pandas and numpy libraries
import pandas as pd

import numpy as np

In [3]:
#Loading the first telcom dataset
Telcom_dataset1 = pd.read_csv('Telcom_dataset.csv')
Telcom_dataset1.head(5)

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [4]:
#Loading the second telcom dataset into our envitonment
Telcom_dataset2 = pd.read_csv('Telcom_dataset2.csv')
Telcom_dataset2.head(5)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [5]:
#Loading the third telcom dataset into our environment
Telcom_dataset3 = pd.read_csv('Telcom_dataset3.csv')
Telcom_dataset3.head(5)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [6]:
#Loading cells geo dataset
cells_geo1 = pd.read_csv('cells_geo.csv' , sep = ";" , index_col=0 )
cells_geo1.head(5)

    VILLES      STATUS LOCALISATION  ... AREA     CELL_ID   SITE_CODE
0   ADJAME  In Service      ABIDJAN  ...  NaN  fbb2e75af3  0bb492ef17
1   ADJAME  In Service      ABIDJAN  ...  NaN  1502501d78  0bb492ef17
2   ADJAME  In Service      ABIDJAN  ...  NaN  0c2e182a0c  0bb492ef17
3  ASSINIE  In Service    INTERIEUR  ...  NaN  69bdfc69fd  8a1e6ce31f
4  ASSINIE  In Service    INTERIEUR  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 11 columns]

In [7]:
#We then prepare to merge the cells_geo dataset by doing some column changes
#Let us rename our site id column using .rename()
cells_geo2 = cells_geo1.rename(columns = {"SITE_CODE":"SITE_ID"})
cells_geo2.head(5)

    VILLES      STATUS LOCALISATION  ... AREA     CELL_ID     SITE_ID
0   ADJAME  In Service      ABIDJAN  ...  NaN  fbb2e75af3  0bb492ef17
1   ADJAME  In Service      ABIDJAN  ...  NaN  1502501d78  0bb492ef17
2   ADJAME  In Service      ABIDJAN  ...  NaN  0c2e182a0c  0bb492ef17
3  ASSINIE  In Service    INTERIEUR  ...  NaN  69bdfc69fd  8a1e6ce31f
4  ASSINIE  In Service    INTERIEUR  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 11 columns]

In [9]:
#Clean up the data by renaming the columns that need renaming
Telcom_dataset1b = Telcom_dataset1.rename(columns={'PRODUTC':'PRODUCT','DATETIME':'DATE_TIME'})
Telcom_dataset1b.head(10)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv
5    data      0  2012-05-06 23:07:26.0  ...     OTHER  /lrUXVGVcN  /lrUXVGVcN
6   Voice      0  2012-05-06 23:08:02.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
7   Voice      0  2012-05-06 23:08:03.0  ...     19e2e  09UjmmY1Ds  09UjmmY1Ds
8   Voice      0  2012-05-06 23:08:05.0  ...     19e2e  0DeimCpZOc  0DeimCpZOc
9     sms      0  2012-05-06 23:08:43.0  ...     19e2e  01MDiY5F89  01MDiY5F89

[10 rows x 10 columns]

In [10]:
#The columns that will be of no use in our analysis will be dropped
#To have only the relevant data.
Telcom_dataset1c = Telcom_dataset1b.drop(['COUNTRY_A' , 'COUNTRY_B'] , axis = 1)
Telcom_dataset1c.head(10)

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0   Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  ...  /+cKZKIp41  /+cKZKIp41
2     sms     25  ...  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  ...  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  ...  051KhYDCpv  051KhYDCpv
5    data      0  ...  /lrUXVGVcN  /lrUXVGVcN
6   Voice      0  ...  +38u2u/rfx  +38u2u/rfx
7   Voice      0  ...  09UjmmY1Ds  09UjmmY1Ds
8   Voice      0  ...  0DeimCpZOc  0DeimCpZOc
9     sms      0  ...  01MDiY5F89  01MDiY5F89

[10 rows x 8 columns]

In [12]:
#The columns "COUNTRY_A" and "COUNTRY_B" will be of no use in telcom_dataset2 so we can drop
#them as we have done above
Telcom_dataset2b = Telcom_dataset2.drop(['COUNTRY_A' , 'COUNTRY_B'] , axis = 1)
Telcom_dataset2b.head(10)

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0     sms      0  ...  +854AcBQT2  +854AcBQT2
1   Voice      0  ...  +854AcBQT2  +854AcBQT2
2     sms      0  ...  +laSrk7g6q  +laSrk7g6q
3   Voice     37  ...  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  ...  +bO+qkSonO  +bO+qkSonO
5     sms      0  ...  /MMplBlWjh  /MMplBlWjh
6   Voice     41  ...  +laSrk7g6q  +laSrk7g6q
7   Voice     11  ...  +gySf02tKW  +gySf02tKW
8     sms      0  ...  /0FxP3az1x  /0FxP3az1x
9     sms      0  ...  0ecjmwPX21  0ecjmwPX21

[10 rows x 8 columns]

In [13]:
#Rename the columns in telcom dataset 2b
Telcom_dataset2c = Telcom_dataset2b.rename(columns = {'DW_A_NUMBER' : 'DW_A_NUMBER_INT', 'DW_B_NUMBER': 'DW_B_NUMBER_INT', 'SITE_ID': 'SITE_ID'} , inplace=False)
Telcom_dataset2c.head(10)

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0     sms      0  ...  +854AcBQT2  +854AcBQT2
1   Voice      0  ...  +854AcBQT2  +854AcBQT2
2     sms      0  ...  +laSrk7g6q  +laSrk7g6q
3   Voice     37  ...  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  ...  +bO+qkSonO  +bO+qkSonO
5     sms      0  ...  /MMplBlWjh  /MMplBlWjh
6   Voice     41  ...  +laSrk7g6q  +laSrk7g6q
7   Voice     11  ...  +gySf02tKW  +gySf02tKW
8     sms      0  ...  /0FxP3az1x  /0FxP3az1x
9     sms      0  ...  0ecjmwPX21  0ecjmwPX21

[10 rows x 8 columns]

In [14]:
#dropping the columns that are of no use in our analysis
Telcom_dataset3b = Telcom_dataset3.drop(['COUNTRY_A' , 'COUNTRY_B'] , axis = 1)
Telcom_dataset3b.head(10)

  PRODUCT  VALUE  ...      CELLID     SIET_ID
0   Voice     61  ...  +38u2u/rfx  +38u2u/rfx
1     sms      0  ...  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  ...  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  ...  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  ...  /eeMklgyJA  /eeMklgyJA
5   Voice     10  ...  +e+xcimwre  +e+xcimwre
6     sms      0  ...  +R5ccmtyJf  +R5ccmtyJf
7   Voice     10  ...  +ZaaZozy/+  +ZaaZozy/+
8     sms     25  ...  13O1+JEun3  13O1+JEun3
9     sms      0  ...  /eeMklgyJA  /eeMklgyJA

[10 rows x 8 columns]

In [15]:
#renaming the columns for clarity
Telcom_dataset3c = Telcom_dataset3b.rename(columns = {'VALUE' : 'VALUE', 'CELLID': 'CELL_ID', 'SIET_ID': 'SITE_ID'} , inplace=False)
Telcom_dataset3c.head(10)

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0   Voice     61  ...  +38u2u/rfx  +38u2u/rfx
1     sms      0  ...  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  ...  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  ...  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  ...  /eeMklgyJA  /eeMklgyJA
5   Voice     10  ...  +e+xcimwre  +e+xcimwre
6     sms      0  ...  +R5ccmtyJf  +R5ccmtyJf
7   Voice     10  ...  +ZaaZozy/+  +ZaaZozy/+
8     sms     25  ...  13O1+JEun3  13O1+JEun3
9     sms      0  ...  /eeMklgyJA  /eeMklgyJA

[10 rows x 8 columns]

In [20]:
#Looking foor duplicate records
Telcom1_2_3['PRODUCT'].duplicated()

0        False
1        False
2         True
3         True
4         True
         ...
14998     True
14999     True
15000     True
15001     True
15002     True
Name: PRODUCT, Length: 15003, dtype: bool

In [18]:
#Merging the 3 telcom datasets for analysis
Telcom1_2 = pd.merge(Telcom_dataset1c , Telcom_dataset2c , how = 'outer')
Telcom1_2_3 = pd.merge(Telcom1_2, Telcom_dataset3c , how = 'outer')
Telcom1_2_3.head(10)

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0   Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  ...  /+cKZKIp41  /+cKZKIp41
2     sms     25  ...  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  ...  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  ...  051KhYDCpv  051KhYDCpv
5    data      0  ...  /lrUXVGVcN  /lrUXVGVcN
6   Voice      0  ...  +38u2u/rfx  +38u2u/rfx
7   Voice      0  ...  09UjmmY1Ds  09UjmmY1Ds
8   Voice      0  ...  0DeimCpZOc  0DeimCpZOc
9     sms      0  ...  01MDiY5F89  01MDiY5F89

[10 rows x 8 columns]

In [19]:
#Let us find the top used products from our merged dataset
Telcom1_2_3['PRODUCT'].value_counts()

sms      7071
Voice    5666
data     2266
Name: PRODUCT, dtype: int64

In [22]:
#Dropping duplicates
Telcom1_2_3.drop_duplicates(inplace=True)
Telcom1_2_3.tail(10)

      PRODUCT  VALUE  ...     CELL_ID     SITE_ID
14993   Voice      1  ...  425d28ede5  5f6100dbe1
14994   Voice     28  ...  12b9783462  d7a531cfa8
14995   Voice    236  ...  26c3cc23da  d2de5847b1
14996   Voice    219  ...  34f124cb0d  73dd78713b
14997   Voice     17  ...  1ba612f62c  25250f86a1
14998   Voice     10  ...  6467daa1db  8a96bae9c1
14999   Voice      0  ...  2aa04dcab7  f7d63a29e5
15000   Voice     62  ...  7f1f2f889f  b4ddb9e93c
15001   Voice     30  ...  98ed726da2  b4130b54ab
15002   Voice     60  ...  1c11a2fcbb  6d70dae094

[10 rows x 8 columns]

In [28]:
#Merging cells geo with telcom merged dataset
Tel_Cell_Geo = pd.merge( Telcom1_2_3, cells_geo2, how ='outer' , on = 'SITE_ID')
Tel_Cell_Geo.head(5)

  PRODUCT  VALUE              DATE_TIME  ... REGION AREA CELL_ID_y
0   Voice    0.0  2012-05-06 23:04:37.0  ...    NaN  NaN       NaN
1     sms    0.0  2012-05-06 23:40:48.0  ...    NaN  NaN       NaN
2     sms    0.0  2012-05-07 23:32:47.0  ...    NaN  NaN       NaN
3     sms    0.0  2012-05-07 23:52:21.0  ...    NaN  NaN       NaN
4    data    0.0  2012-05-07 23:53:21.0  ...    NaN  NaN       NaN

[5 rows x 18 columns]

In [27]:
#Checking column details
Tel_Cell_Geo.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 55345 entries, 0 to 55344
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUCT          54829 non-null  object
 1   VALUE            54829 non-null  float64
 2   DATE_TIME        54829 non-null  object
 3   CELL_ON_SITE     54829 non-null  object
 4   DW_A_NUMBER_INT  54829 non-null  object
 5   DW_B_NUMBER_INT  54829 non-null  object
 6   CELL_ID_x        54829 non-null  object
 7   SITE_ID          53384 non-null  object
 8   VILLES           50834 non-null  object
 9   STATUS           50128 non-null  object
 10  LOCALISATION     50834 non-null  object
 11  DECOUPZONE       50834 non-null  object
 12  ZONENAME         50816 non-null  object
 13  LONGITUDE        50834 non-null  float64
 14  LATITUDE         50834 non-null  float64
 15  REGION           50834 non-null  object
 16  AREA             50571 non-null  object
 17  CELL_ID_y        50834 non-null  object
dtypes: float64(3), object(15)
memory usage: 8.0+ MB

In [30]:
#Finding the product with the highest average use
Tel_Cell_Geo.groupby(['PRODUCT'], as_index=False).mean()

  PRODUCT      VALUE  LONGITUDE  LATITUDE
0   Voice  55.175730  -4.754747  6.055267
1    data   7.751121        NaN       NaN
2     sms   7.872243  -4.565803  5.762781

In [33]:
#Check for most used product while
#grouping by relevant columns
Working_df = pd.DataFrame(Tel_Cell_Geo.groupby(['VILLES','LOCALISATION','ZONENAME','SITE_ID','PRODUCT'])['VALUE'].sum())
Working_df

                                                                 VALUE
VILLES     LOCALISATION ZONENAME            SITE_ID    PRODUCT
ABENGOUROU INTERIEUR    ZONE C - Grand-EST  00197a4f5f Voice    2172.0
                                                       sms      1200.0
                                            40cb5c4468 Voice    1434.0
                                                       sms       150.0
                                            547385b9d5 Voice    1539.0
...                                                                ...
ZUENOULA   INTERIEUR    ZONE A - Grand-NORD 43adae9a57 sms         0.0
                                            61bee9c70c Voice     804.0
                                                       sms         0.0
                                            f91ed8d2e9 Voice    2037.0
                                                       sms       300.0

[1482 rows x 1 columns]

In [34]:
#We then use the working df to check the cities with the most activity
City_activity = pd.pivot_table(Working_df, index=['VILLES'], aggfunc='sum')
City_activity

                  VALUE
VILLES
ABENGOUROU       8583.0
ABOBO          124210.0
ABOISSO          1650.0
ABOISSO COMOE     795.0
ABONGOUA            3.0
...                 ...
ZATTA               3.0
ZIKISSO           968.0
ZON-HOUNIEN       363.0
ZOUKOUGBEU        714.0
ZUENOULA         3846.0

[398 rows x 1 columns]

In [35]:
#We can now sort our values to find out
#The order of cities by activity
City_activity_sorted = City_activity.sort_values('VALUE',ascending=False)
City_activity_sorted

                VALUE
VILLES
YOPOUGON     204067.0
COCODY       184674.0
ABOBO        124210.0
KOUMASSI      71356.0
TREICHVILLE   65557.0
...               ...
SAMO              0.0
MAHAPLEU          0.0
SAHUE             0.0
RUBINO            0.0
FEREDOUGOU        0.0

[398 rows x 1 columns]

In [36]:
#Activity checks by localization
#values
Localization_activity = pd.pivot_table(Working_df, index=['LOCALISATION'],aggfunc='sum')
Localization_activity

                 VALUE
LOCALISATION
ABIDJAN       861337.0
INTERIEUR     544602.0

In [37]:
#Checking zones with the most activity
Zone_Activity = pd.pivot_table(Working_df, index=['ZONENAME','VILLES'],aggfunc='sum')
Zone_Activity

                                 VALUE
ZONENAME           VILLES
AGBANNEW           ADJAME        102.0
NPONON             ABOBO        3596.0
OKAHOTEL           ABOBO         760.0
PALMABINGERVILLE   BINGERVILLE   783.0
WILLIAMSVILLE2     ADJAME        756.0
...                                ...
ZONE E - SUD-OUEST SERHIO          0.0
                   SOUBRE       7736.0
                   TABOU         438.0
                   TOUIH         270.0
                   YOUWASSO        0.0

[427 rows x 1 columns]

In [38]:
#sorting in ascending order
Zone_Activity1 = Zone_Activity.sort_values('VALUE',ascending=False)
Zone_Activity1

                                         VALUE
ZONENAME                VILLES
ZONE C - Abidjan_OUEST  YOPOUGON      204067.0
ZONE B - Abidjan_EST    COCODY        162146.0
ZONE E - Abidjan_NORD   ABOBO         119854.0
ZONE A - Abidjan_CENTRE TREICHVILLE    65557.0
ZONE D - Abidjan_SUD    KOUMASSI       54958.0
...                                        ...
ZONE E - SUD-OUEST      BALEKO             0.0
ZONE A - Grand-NORD     YAOSEDOUGOU        0.0
                        WENDENE            0.0
                        TORO-KINKENE       0.0
ZONE E - SUD-OUEST      YOUWASSO           0.0

[427 rows x 1 columns]